[
    {
        "Title": "Update: BAE And Jinni Star In New Teasers For JYP’s New Girl Group NMIXX’s Debut “AD MARE”",
        "URL": "https://www.soompi.com/article/1511114wpp/jyps-new-girl-group-nmixx-announces-debut-date-and-details-with-intriguing-teaser",
        "Content": "Updated February 13 KST:  BAE and Jinni are next to star in “MIX” concept photos for NMIXX’s “AD MARE” debut!  Updated February 12 KST:  NMIXX has begun a new round of concept photos, this time titled “MIX” version, starting with Sullyoon and Haewon!   Updated February 11 KST:  Kyujin, Jiwoo, and Lily are the last members of NMIXX to star in debut teasers for their first single “AD MARE”!  NMIXX1st Single Moving PosterKYUJINhttps://t.co/oWlTGCNQhA 2022.02.22 6:00PM (KST)2022.02.22 4:00AM (EST)#NMIXX #엔믹스#규진 #KYUJIN#AD_MARE#OO pic.twitter.com/raNqlwQ7l3 — NMIXX (@NMIXX_official) February 10, 2022    NMIXX1st Single Moving PosterJIWOOhttps://t.co/QoLjOC3NRt 2022.02.22 6:00PM (KST)2022.02.22 4:00AM (EST)#NMIXX #엔믹스#지우 #JIWOO#AD_MARE#OO pic.twitter.com/zWdV1ifX8V — NMIXX (@NMIXX_official) February 10, 2022    NMIXX1st Single Moving PosterLILYhttps://t.co/g0da4WdYLu 2022.02.22 6:00PM (KST)2022.02.22 4:00AM (EST)#NMIXX #엔믹스#릴리 #LILY#AD_MARE#OO pic.twitter.com/JtBBI8K12G — NMIXX (@NMIXX_official) February 10, 2022  Updated February 10 KST: JYP Entertainment’s new girl group NMIXX has now released concept photos and moving posters of Jinni and Bae for their upcoming debut single “AD MARE”!   NMIXX1st Single Moving PosterJINNIhttps://t.co/xZNjyR2k1V 2022.02.22 6:00PM (KST)2022.02.22 4:00AM (EST)#NMIXX #엔믹스#지니 #JINNI#AD_MARE#OO pic.twitter.com/Ju4j6348Bq — NMIXX (@NMIXX_official) February 9, 2022    NMIXX1st Single Moving PosterBAEhttps://t.co/e5JnfJwTfP 2022.02.22 6:00PM (KST)2022.02.22 4:00AM (EST)#NMIXX #엔믹스#배이 #BAE#AD_MARE#OO pic.twitter.com/x6RAUMebVV — NMIXX (@NMIXX_official) February 9, 2022  Updated February 9 KST: JYP Entertainment’s new girl group NMIXX has released concept photos and moving posters of Haewon and Sullyoon for their upcoming debut with “AD MARE”!   NMIXX1st Single Moving PosterHAEWONhttps://t.co/3dRjNyo4P6 2022.02.22 6:00PM (KST)2022.02.22 4:00AM (EST)#NMIXX #엔믹스#해원 #HAEWON#AD_MARE#OO pic.twitter.com/93WEoNOrHG — NMIXX (@NMIXX_official) February 8, 2022    NMIXX1st Single Moving PosterSULLYOONhttps://t.co/us4nTGm2TG 2022.02.22 6:00PM (KST)2022.02.22 4:00AM (EST)#NMIXX #엔믹스#설윤 #SULLYOON#AD_MARE#OO pic.twitter.com/YUNhEauWLp — NMIXX (@NMIXX_official) February 8, 2022  Updated February 8 KST:  JYP Entertainment’s new girl group NMIXX has unveiled a group concept image for their debut with “AD MARE”:  Updated February 7 KST: JYP Entertainment’s new girl group NMIXX has released the track list for their upcoming single album “AD MARE”! Check out the full track list below:  Original Article: Mark your calendars for the debut of JYP Entertainment’s new girl group NMIXX! On February 3 at midnight KST, NMIXX officially revealed the date and details for their highly-anticipated debut. The seven-member girl group will make their debut on February 22 with their first single “AD MARE,” which will drop at 6 p.m. KST. NMIXX also released an intriguing teaser poster for “AD MARE”—as well as a moving version of the poster—which you can check out below!   You can check out the seven NMIXX members’ official debut profile photos here, and you can follow the group on their official social media accounts here!  ",
        "Writer": "E. Cha",
        "Date": "Feb 2, 2022",
        "Category": "A",
        "IMG Link": "https://6.viki.io/image/5c5e593ec9a34d57b5df6f3dc540d0dc/dummy.jpeg?s=7x5&e=t",
        "Website": "soompi",
        "Artist": "nmixx"
    },
    {
        "Title": "Watch: JYP’s New Girl Group NMIXX Unveils First Debut Photos + Debut Trailer",
        "URL": "https://www.soompi.com/article/1510449wpp/watch-jyps-new-girl-group-nmixx-unveils-first-debut-photos-debut-trailer",
        "Content": "After unveiling their group name and social media accounts, JYP Entertainment’s highly anticipated new girl group NMIXX has shared a new set of debut photos and a trailer! The debut photos also come with information about each member’s stage name and birth date. Check them out below! Kyujin was born on May 26, 2006.  Jiwoo was born on April 13, 2005.  BAE was born on December 28, 2004.  Jinni was born on April 16, 2004.  Sullyoon was born on January 26, 2004.  Haewon was born on February 25, 2003.  Lily was born on October 17, 2002.  Check the girls out in their debut trailer:  Stay tuned for updates!  ",
        "Writer": "C. Hong",
        "Date": "Jan 27, 2022",
        "Category": "A",
        "IMG Link": "https://6.viki.io/image/02a5f941e1e84afeae95a2a94ed7c147/dummy.jpeg?s=7x5&e=t",
        "Website": "soompi",
        "Artist": "nmixx"
    },
    {
        "Title": "Watch: JYP’s New Girl Group Announces Name Through Debut Teaser + Launches Official Social Media Accounts",
        "URL": "https://www.soompi.com/article/1510043wpp/watch-jyp-announces-name-of-new-girl-group-through-debut-teaser-launches-official-social-media-accounts",
        "Content": "Updated January 27 KST: In addition to their previous teaser, JYP Entertainment’s upcoming girl group NMIXX has now released a new debut trailer entitled “New Frontier: Declaration”! Check out the new video below:  Original Article: The highly-anticipated debut of JYP Entertainment’s next girl group is almost here! On January 26 at midnight KST, JYP Entertainment officially announced the name of their upcoming seven-member girl group: NMIXX. Last year, the agency introduced the seven members of NMIXX—which was then tentatively called JYPn—through a series of dance videos and song covers. At the time, JYP Entertainment stated that the new girl group, which will consist of members Kyujin, Jiwoo, BAE, Jinni, Sullyoon, Haewon, and Lily, would make their debut sometime in February 2022. In addition to releasing a debut teaser clip entitled “NICE TO MIXX YOU,” JYP Entertainment also launched several official media accounts for NMIXX, which you can check out below!  [?] NMIXX OFFICIAL CHANNEL OPEN YouTube ➫ https://t.co/vWnZ7TDlALTwitter ➫ https://t.co/xukx6M1wOCInstagram ➫ https://t.co/pBCpP38XizFacebook ➫ https://t.co/GBvrsltfBGWeibo ➫ https://t.co/zUqqOnWQjM#NMIXX #엔믹스 — NMIXX (@NMIXX_official) January 25, 2022  Are you excited for NMIXX’s debut? Stay tuned for further updates!  ",
        "Writer": "E. Cha",
        "Date": "Jan 25, 2022",
        "Category": "A",
        "IMG Link": "https://6.viki.io/image/a8f228c8f7934a078d5a25161c98ac49/dummy.jpeg?s=7x5&e=t",
        "Website": "soompi",
        "Artist": "nmixx"
    }
]